In [ ]:
import pandas as pd

s_df = pd.read_excel('student_data.xlsx')

In [ ]:
s_df

     Name  Age Class  Marks Gender
0    Mary   34    F4   80.0      F
1    John   23   NaN   50.0      M
2   Peter   30    F4   20.0      M
3   Clair   19    F5    NaN      F
4  Claude   25    F5   30.0      M
5     Dav   18    F4   70.0      M
6   Glory   20    F5   40.0      F

In [ ]:
s_df.isnull()

    Name    Age  Class  Marks  Gender
0  False  False  False  False   False
1  False  False   True  False   False
2  False  False  False  False   False
3  False  False  False   True   False
4  False  False  False  False   False
5  False  False  False  False   False
6  False  False  False  False   False

In [4]:
s_df.isnull().any()

Name      False
Age       False
Class      True
Marks      True
Gender    False
dtype: bool

In [101]:
s_df.isnull().sum()

Name      0
Age       0
Class     1
Marks     1
Gender    0
dtype: int64

In [5]:
## Filling missing values

s_df['Class'] = s_df['Class'].fillna('F4')
s_df['Marks'] = s_df['Marks'].fillna(s_df['Marks'].mean())

In [6]:
s_df

     Name  Age Class      Marks Gender
0    Mary   34    F4  80.000000      F
1    John   23    F4  50.000000      M
2   Peter   30    F4  20.000000      M
3   Clair   19    F5  48.333333      F
4  Claude   25    F5  30.000000      M
5     Dav   18    F4  70.000000      M
6   Glory   20    F5  40.000000      F

In [115]:
## Aggregation and Groupping
grouped_mean = s_df.groupby('Class')['Marks'].mean()
print(grouped_mean)

Class
F4    55.000000
F5    39.444444
Name: Marks, dtype: float64

In [ ]:
## Groupping more than one column

grouped_mean = s_df.groupby(['Class', 'Gender'])['Marks'].mean()
print(grouped_mean)

Class  Gender
F4     F         80.000000
       M         46.666667
F5     F         44.166667
       M         30.000000
Name: Marks, dtype: float64

In [119]:
## aggregate multiple functions
grouped_agg = s_df.groupby('Gender')['Marks'].agg(['sum', 'mean', 'count'])
grouped_agg

               sum       mean  count
Gender
F       168.333333  56.111111      3
M       170.000000  42.500000      4

In [128]:
## Merging and Joining DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value': [1,2,3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value': [4,5,6]})

In [129]:
df1

  key  value
0   A      1
1   B      2
2   C      3

In [130]:
df2

  key  value
0   A      4
1   B      5
2   D      6

In [131]:
## Merge on key columns
pd.merge(df1, df2, on='key', how='inner')

  key  value_x  value_y
0   A        1        4
1   B        2        5

In [132]:
pd.merge(df1, df2, on='key', how='outer')

  key  value_x  value_y
0   A      1.0      4.0
1   B      2.0      5.0
2   C      3.0      NaN
3   D      NaN      6.0

In [133]:
pd.merge(df1, df2, on='key', how='left')

  key  value_x  value_y
0   A        1      4.0
1   B        2      5.0
2   C        3      NaN

In [134]:
pd.merge(df1, df2, on='key', how='right')

  key  value_x  value_y
0   A      1.0        4
1   B      2.0        5
2   D      NaN        6